cfd-sidecar/templates/cavity/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  (minimal template)                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 8.4375;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 8.4375;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 8.4375;
        value           uniform 8.4375;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 8.4375;
    }
}

// ************************************************************************* //
